/*************************************************************************
	t = 0为fwt，t = 1为逆fwt inv2 = Pow(2,p-2)
 ************************************************************************/
void fwt(LL *a,int n,int t) {
    for (int i = 1; i < n; i <<= 1) {
        for (int j = 0; j < n; j += (i << 1))
            for (int k = j; k < i + j; k++) {
                LL x = a[k], y = a[k + i];
                a[k] = (x + y) % p, a[k + i] = (x - y + p) % p;
                if (t)a[k] = a[k] * inv2 % p, a[k + i] = a[k + i] * inv2 % p;
            }
    }

}
